Revit 2027 API
Generic.GenericGlossiness Property
 The property labeled "Glossiness" from the "Generic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GenericGlossiness { get; }
Public Shared ReadOnly Property GenericGlossiness As String
	Get
public:
static property String^ GenericGlossiness {
	String^ get ();
}
static member GenericGlossiness : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble". This property allows a connected asset.
See Also
Reference
Generic Class
Autodesk.Revit.DB.Visual Namespace